Introduction to Pandas üêº

# PRACTICE QUESTIONS

In [7]:
import pandas as pd

In [10]:
animals=pd.DataFrame( {
    "animal_id": [1, 2, 3, 4, 5, 6, 7],
    "name": ["Blue Whale", "Clownfish", "Great White Shark", "Sea Turtle", "Octopus", "Jellyfish", "Manta Ray"],
    "species_type": ["Mammal", "Fish", "Fish", "Reptile", "Cephalopod", "Cnidarian", "Fish"],
    "avg_length_cm": [3000, 11, 500, 120, 60, 30, 700],
    "avg_weight_kg": [150000, 0.25, 1100, 180, 7, 2, 1600],
    "habitat": ["Open Ocean", "Coral Reefs", "Coastal Waters", "Tropical Seas", "Ocean Floor", "Shallow Seas", "Open Ocean"],
    "endangered": ["True", "False", "Vulnerable", "Endangered", "False", "False", "Near Threatened"]
})
animals

,animal_id,name,species_type,avg_length_cm,avg_weight_kg,habitat,endangered
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened

In [11]:
animals

,animal_id,name,species_type,avg_length_cm,avg_weight_kg,habitat,endangered
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened

# Level 1 ‚Äî Selecting Columns

Select the name column as a Series.

In [12]:
animals.name

0           Blue Whale
1            Clownfish
2    Great White Shark
3           Sea Turtle
4              Octopus
5            Jellyfish
6            Manta Ray
Name: name, dtype: object

Select species_type and habitat as a DataFrame.

In [13]:
animals[["species_type","habitat"]]

  species_type         habitat
0       Mammal      Open Ocean
1         Fish     Coral Reefs
2         Fish  Coastal Waters
3      Reptile   Tropical Seas
4   Cephalopod     Ocean Floor
5    Cnidarian    Shallow Seas
6         Fish      Open Ocean

# Level 2 ‚Äî Getting Values

Display only the first 3 animal names.

In [16]:
animals.loc[:2,["name"]]

                name
0         Blue Whale
1          Clownfish
2  Great White Shark

or

In [17]:
animals.name.iloc[:3]

0           Blue Whale
1            Clownfish
2    Great White Shark
Name: name, dtype: object

Display the last 2 weights.

In [18]:
animals["avg_weight_kg"].iloc[-2:]

5       2.0
6    1600.0
Name: avg_weight_kg, dtype: float64

# Level 3 ‚Äî Renaming Columns

Rename: avg_length_cm ‚Üí length

In [20]:
animals.rename(columns={"avg_length_cm":"length"},inplace=True)
animals

,animal_id,name,species_type,length,avg_weight_kg,habitat,endangered
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened

Rename: avg_weight_kg ‚Üí weight

In [21]:
animals.rename(columns={"avg_weight_kg":"weight"},inplace=True)
animals

,animal_id,name,species_type,length,weight,habitat,endangered
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened

# Level 4 ‚Äî Removing Columns

Drop the endangered column.

In [ ]:
animals.drop(columns="endangered")# note that i havent added inplace=True so the original dataframe remains unchanged

,animal_id,name,species_type,length,weight,habitat
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean
1,2,Clownfish,Fish,11,0.25,Coral Reefs
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas
6,7,Manta Ray,Fish,700,1600.00,Open Ocean

Drop species_type and habitat together.

In [ ]:
animals.drop(columns={"species_type","habitat"})# note that i havent added inplace=True so the original dataframe remains unchanged

   animal_id               name  length     weight       endangered
0          1         Blue Whale    3000  150000.00             True
1          2          Clownfish      11       0.25            False
2          3  Great White Shark     500    1100.00       Vulnerable
3          4         Sea Turtle     120     180.00       Endangered
4          5            Octopus      60       7.00            False
5          6          Jellyfish      30       2.00            False
6          7          Manta Ray     700    1600.00  Near Threatened

# Level 5 ‚Äî Adding Columns

Add a new column size_category based on avg_length_cm: 1000 ‚Üí "giant" 100 ‚Üí "large" ,50 ‚Üí "medium" else ‚Üí "small

In [27]:
import numpy as np
conditions= [
    animals["length"]>1000,
    animals["length"]>100,
    animals["length"]>50
]
choices=["giant","large","medium"]
animals["size_category"]=np.select(conditions,choices,default="small")
animals

,animal_id,name,species_type,length,weight,habitat,endangered,size_category
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True,giant
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False,small
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable,large
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered,large
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False,medium
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False,small
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened,large

or

In [29]:
def categorize_length(length):
    if length > 1000:
        return "giant"
    elif length > 100:
        return "large"
    elif length > 50:
        return "medium"
    else:
        return "small"

animals["size_category"] = animals["length"].apply(categorize_length)
animals

,animal_id,name,species_type,length,weight,habitat,endangered,size_category
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True,giant
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False,small
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable,large
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered,large
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False,medium
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False,small
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened,large

Add a new column is_heavy: True if avg_weight_kg > 500 False otherwise

In [31]:
def heav(weight):
    if weight>500:
        return "heavy"
    else:
        return "false"
    
animals["is_heavy"]=animals["weight"].apply(heav)
animals

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True,giant,heavy
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False,small,false
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable,large,heavy
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered,large,false
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False,medium,false
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False,small,false
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened,large,heavy

# Level 6 ‚Äî Sorting

Sort by avg_length_cm ascending.

In [ ]:
animals.sort_values("length")# note that we have changed avg_length_cm to length earlier

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False,small,false
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False,small,false
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False,medium,false
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered,large,false
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable,large,heavy
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened,large,heavy
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True,giant,heavy

Sort by avg_weight_kg descending.

In [ ]:
animals.sort_values("weight",ascending=False)# note that we have changed avg_weight_kg to weight earlier

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
0,1,Blue Whale,Mammal,3000,150000.00,Open Ocean,True,giant,heavy
6,7,Manta Ray,Fish,700,1600.00,Open Ocean,Near Threatened,large,heavy
2,3,Great White Shark,Fish,500,1100.00,Coastal Waters,Vulnerable,large,heavy
3,4,Sea Turtle,Reptile,120,180.00,Tropical Seas,Endangered,large,false
4,5,Octopus,Cephalopod,60,7.00,Ocean Floor,False,medium,false
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False,small,false
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False,small,false

#Level 7 ‚Äî Filtering

Show all animals with avg_length_cm > 100.

In [35]:
animals[animals["length"]>100]

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
0,1,Blue Whale,Mammal,3000,150000.0,Open Ocean,True,giant,heavy
2,3,Great White Shark,Fish,500,1100.0,Coastal Waters,Vulnerable,large,heavy
3,4,Sea Turtle,Reptile,120,180.0,Tropical Seas,Endangered,large,false
6,7,Manta Ray,Fish,700,1600.0,Open Ocean,Near Threatened,large,heavy

Filter animals whose habitat is ‚ÄúOpen Ocean‚Äù.

In [36]:
animals[animals["habitat"]=="Open Ocean"]

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
0,1,Blue Whale,Mammal,3000,150000.0,Open Ocean,True,giant,heavy
6,7,Manta Ray,Fish,700,1600.0,Open Ocean,Near Threatened,large,heavy

Show only animals that are endangered or vulnerable.

In [38]:
animals[(animals["endangered"]=="True")| (animals["endangered"]=="Vulnerable")]

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
0,1,Blue Whale,Mammal,3000,150000.0,Open Ocean,True,giant,heavy
2,3,Great White Shark,Fish,500,1100.0,Coastal Waters,Vulnerable,large,heavy

# Level 8 ‚Äî Multiple Filters

avg_length_cm > 50 AND habitat = ‚ÄúCoral Reefs‚Äù

In [ ]:
animals[(animals["length"]>50) & (animals["habitat"]=="Coral Reefs")]

Empty DataFrame
Columns: [animal_id, name, species_type, length, weight, habitat, endangered, size_category, is_heavy]
Index: []

species_type = ‚ÄúFish‚Äù AND avg_weight_kg > 500

In [42]:
animals[(animals["species_type"]=="Fish") & (animals["weight"]>500)]

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
2,3,Great White Shark,Fish,500,1100.0,Coastal Waters,Vulnerable,large,heavy
6,7,Manta Ray,Fish,700,1600.0,Open Ocean,Near Threatened,large,heavy

# Level 9 ‚Äî loc / iloc

Select first 3 rows and first 2 columns using iloc.

In [43]:
animals.iloc[:3,:2]

   animal_id               name
0          1         Blue Whale
1          2          Clownfish
2          3  Great White Shark

Select rows 2‚Äì5 and columns: name, habitat, avg_weight_kg using loc.

In [44]:
animals.loc[2:5,["name","habitat","weight"]]

                name         habitat  weight
2  Great White Shark  Coastal Waters  1100.0
3         Sea Turtle   Tropical Seas   180.0
4            Octopus     Ocean Floor     7.0
5          Jellyfish    Shallow Seas     2.0

Select last 2 rows using negative slicing

In [45]:
animals[-2:]

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
5,6,Jellyfish,Cnidarian,30,2.0,Shallow Seas,False,small,false
6,7,Manta Ray,Fish,700,1600.0,Open Ocean,Near Threatened,large,heavy

# Level 10 ‚Äî Challenge

Find the largest animal by avg_length_cm.

In [48]:
animals[animals["length"] == animals["length"].sort_values(ascending=False).head(1).values[0]]

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
0,1,Blue Whale,Mammal,3000,150000.0,Open Ocean,True,giant,heavy

or

In [ ]:
animals.loc[animals["length"].idxmax(),"name"]

'Blue Whale'

Count how many animals are in each species_type.

In [53]:
animals.value_counts("species_type")

species_type
Fish          3
Cephalopod    1
Cnidarian     1
Mammal        1
Reptile       1
Name: count, dtype: int64

Show the animals that have letters ‚Äúsh‚Äù in their name (like ‚Äúshark‚Äù).

In [58]:
animals[animals['name'].str.contains('sh')]

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
1,2,Clownfish,Fish,11,0.25,Coral Reefs,False,small,false
5,6,Jellyfish,Cnidarian,30,2.00,Shallow Seas,False,small,false

Show only animals living in Shallow Seas or open ocean habitats.

In [62]:
animals[animals["habitat"].isin(["Open Ocean","Shallow Seas"])]

,animal_id,name,species_type,length,weight,habitat,endangered,size_category,is_heavy
0,1,Blue Whale,Mammal,3000,150000.0,Open Ocean,True,giant,heavy
5,6,Jellyfish,Cnidarian,30,2.0,Shallow Seas,False,small,false
6,7,Manta Ray,Fish,700,1600.0,Open Ocean,Near Threatened,large,heavy

From your dataframe, show all unique habitats

In [63]:
animals.habitat.unique()

array(['Open Ocean', 'Coral Reefs', 'Coastal Waters', 'Tropical Seas',
       'Ocean Floor', 'Shallow Seas'], dtype=object)